In [ ]:
#This is a python package
#Python packages are pre-made code that give us shortcuts to doing our work
#This python package is called pandas and helps us load data and manipulate it 
import pandas as pd

In [ ]:
#Let's read in our comma separated values file (CSV), called grades.csv
#A comma separated values file is just a file where each data point
#is separated by a comma
#Click this link to see the raw data
grades = pd.read_csv('grades.csv') #this command reads in our data into the grades variable

In [ ]:
grades.head()

      Name  Assignment1  Exam1
0     Tom            40     75
1  Allison           95     99
2     Mike           55     87
3     Kate          100     81
4  Bernard           90     54

In [ ]:
#We can also create this data manually by hand using the code below if we
#don't have the data already stored
data = pd.DataFrame(columns = ['Name','Assignment1', 'Exam1'])

In [ ]:
#We assign our data separately in lists to the following variables
students = ['Tom', 'Allison', 'Mike', 'Kate', 'Bernard']
as1 = [40, 95, 55, 100, 90]
exam1 = [75, 99, 87, 81, 54]

In [ ]:
#We then create columns in our table based on the previous created lists
data['Name'] = students
data['Assignment1'] = as1
data['Exam1'] = exam1

In [ ]:
data.head()

      Name  Assignment1  Exam1
0      Tom           40     75
1  Allison           95     99
2     Mike           55     87
3     Kate          100     81
4  Bernard           90     54

In [ ]:
#What types of data do we have? 
#Our Name column is a qualitative data type because it is

# What types of data do we have? 
Our Name column is a qualitative data type because it is a non-numeric value that describes our data. 

Our assignment 1 and exam 1 columns are discrete numeric data types because they can only hold values between 0-100.